app/Http/Controllers/ComentariosController.php

    public function index()
    {
        $allcomentarios = Comentarios::all(); #Para recuperar los datos de la tabla
---
select * from `comentarios`