app/Http/Controllers/IngredientesController.php

select * from `ingredientes`
---
    public function index()
    {
        $ingredientes = Ingredientes::all(); //recupera todo lo de la tabla

insert into `ingredientes` (`nombre`, `cantidad`, `unidadMedida`, `updated_at`, `created_at`) values ('Deneb', '0.6', 'Kg', '2023-11-14 02:01:27', '2023-11-14 02:01:27')
---
    public function store(Request $request)
    {
        $request->validate([
            'nombre' => 'required|regex:/^[\pL\s\-]+$/u|max:150',
            'cantidad' => 'required|numeric|min:0',
            'unidadMedida' => 'nullable' // Acepta un valor nulo (opcional)
        ]);

        Ingredientes::create($request->all());

delete from `ingredientes` where `id` = 1
---
    public function destroy(Ingredientes $ingrediente)
    {
        $ingrediente->delete();