app/Http/Controllers/RecetasController.php

select * from `recetas`
---
    public function index()
    {
        $recetas = Recetas::all(); ///regresa todo lo de la tabla

select * from `etiquetas`
---
    public function create()
    {
        $etiquetas = Etiqueta::all();

insert into `recetas` (`titulo`, `descripcion`, `tipoComida`, `updated_at`, `created_at`) values ('test', 'test', 'Comida', '2023-11-14 19:22:02', '2023-11-14 19:22:02')
---
    public function store(Request $request)
    {
        $request->validate([
            'titulo' => 'required|regex:/^[\pL\s\-]+$/u|max:150',
            'tipoComida' => 'required|regex:/^[\pL\s\-]+$/u|max:100',
            'descripcion' => 'required|string|max:1000'
        ]);

        //$request->validate([]);
        $recetas = new Recetas();
        $recetas->titulo = $request->titulo;
        $recetas->descripcion = $request->descripcion;
        $recetas->tipoComida = $request->tipoComida;
        $recetas->save();

insert into `recetas` (`titulo`, `descripcion`, `tipoComida`, `archivo_nombre`, `archivo_ubicacion`, `updated_at`, `created_at`) values ('Pastel de carne', 'Delicioso', 'Almuerzo', 'crema-alpura-acida-regular-450-ml.jpg', 'public/imagenes-recetas/Qlbjb4up7HChX2KeMXK126ZNauOuRvYXsbAAtL8Y.png', '2023-11-18 08:19:26', '2023-11-18 08:19:26')
---
    public function update(Request $request, Recetas $receta)
    {
        $receta->titulo = $request->titulo;
        $receta->descripcion = $request->descripcion;
        $receta->tipoComida = $request->tipoComida;
        $receta->save();